Lab 24-2
===

## Objectifs
* Mise en pratique du module sur le protocole OSPF

**Durée** : 20 minutes

## Prise en main
1. Ouvrir le projet _Lab_24-2.gns3project_ ;
3. Démarrer l'ensemble des routeurs (triangle vert) ;

## Configuration du _backbone_
1. Démarer une capture réseau entre R2 et R3.
2. Configurer le protocole OSPF sur les routeurs R1 à R4 qui constituent le _backbone (area 0)_  pour annoncer les réseaux verts (interfaces) et violet (_lo0_) avec OSPF.
    <details>
    <summary>Astuce 1</summary>

    <ul>
      <li>Pour appliquer une même configuration sur plusieurs interfaces dont la numérotation est continue entre <em>n</em> et <em>p</em>, il est possible de sélectionner l'ensemble de ces interfaces avec la commande <em>interface range e 1/n - p</em>.</li>
    </ul>
    </details>
    <details>
    <summary>Solution 1</summary>

    <pre>
    Sur R4 :

    R4(config)# router ospf 1
    R4(config-router)# router-id 172.20.0.4
    R4(config-router)# network 10.0.0.8 0.0.0.1 area 0
    R4(config-router)# network 10.0.0.12 0.0.0.1 area 0
    R4(config-router)# network 10.0.0.18 0.0.0.1 area 0
    R4(config-router)# network 10.0.0.20 0.0.0.1 area 0
    R4(config-router)# networ 172.20.0.4 0.0.0.0 area 0
    </pre>
    </details>
    <details>
    <summary>Solution 2</summary>

    <pre>
    Sur R4 :

    R4(config)# interface range e 1/0 - 3
    R4(config-if-range)# ip ospf 1 area 0
    R4(config-if-range)# exit
    R4(config)# interface lo 0
    R4(config-if)# ip ospf 1 area 0
    R4(config-if-range)# exit
    R4(config)# router ospf 1
    R4(config-router)# router-id 172.20.0.4

    </pre>
    </details>

 3. Observer la table de routage du routeur R1. Vérifier la présence de toutes les _loopback0_ du _backbone_.
    <details>
    <summary>Solution</summary>

    <pre>
        172.20.0.0/32 is subnetted, 5 subnets
    C       172.20.0.1 is directly connected, Loopback0
    O       172.20.0.2 [110/11] via 10.0.0.1, 00:01:46, Ethernet1/0
    O       172.20.0.3 [110/21] via 10.0.0.5, 00:01:46, Ethernet1/2
                    [110/21] via 10.0.0.1, 00:01:46, Ethernet1/0
    O       172.20.0.4 [110/21] via 10.0.0.1, 00:01:46, Ethernet1/0
    O       172.20.0.5 [110/11] via 10.0.0.5, 00:01:46, Ethernet1/2
    </pre>
    </details>
4. Observer les traces réseaux capturées entre R2 et R3.

5. Lors des configurations des routeurs R1 et R3, un message d'erreur apparait. Lequel ? Faire la correction nécessaire.
    <details>
      <summary>Solution</summary>

      Le message suivant apparaît :
      <pre>
      [...]%IP-4-DUPADDR: Duplicate address 10.0.0.2 on Ethernet1/0,[...]
      </pre>
      Il y a une erreur de configuration : la même IP 10.0.0.2 a été renseignée l'interface de deux routeurs adjacents (R1 et R3).
      Pour corriger, il faut, sur R3, exécuter la commande suivante :
      <pre>
      R3(config)# interface e 1/0
      R3(config-if)# ip add 10.0.0.3 255.255.255.254
      </pre>
    </details>
## Configuration des aires
1. Configurer le protocole OSPF sur les routeurs R5, R8 et R11 qui constituent les frontières entre le _backbone_ et leur aires respectives (ABR).
    <details>
    <summary>Solution</summary>

    <pre>
    Sur R5 :

    R4(config)# interface range e 1/2 - 3
    R4(config-if-range)# ip ospf 1 area 0
    R4(config-if-range)# exit
    R4(config)# interface range e 1/0 - 1
    R4(config-if-range)# ip ospf 1 area 1
    R4(config-if-range)# exit
    R4(config)# router ospf 1
    R4(config-router)# router-id 172.20.0.5
    </pre>
    </details>
2. Configurer le routage au sein de chacune des aires
3. Observer la table de routage du routeur R2. Comment apparaissent les routes internes aux aires ?
    <details>
    <summary>Solution</summary>

    Elles apparaissent préfixée par <em>O IA</em>.
    <pre>
    O IA    10.0.1.2 [110/20] via 10.0.0.15, 00:00:00, Ethernet1/3
    O IA    10.0.1.0 [110/20] via 10.0.0.15, 00:00:00, Ethernet1/3      
    </pre>
    </details>

4. Sur R1, le réseau _203.0.113.0/24_ est-il annoncé ? Trouver la panne et réparer la.
    <details>
    <summary>Solution</summary>

    Les interfaces physiques du routeur sont <em>shutdown</em>.
    <pre>
    R12(config)# interface range e 1/0 - 1
    R12(config-if-range)# no shutdown
    </pre>
    </details>